EDT/УТ/src/InformationRegisters/НастройкиУчетаОбщие/НастройкиУчетаОбщие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаОбщие</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ПовышающийКоэффициентТарификацииКилометража</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СистемаРаспознаванияАдресов</name>
    <type>
      <types>EnumRef.СистемыРаспознаванияАдресов</types>
    </type>
  </resources>
  <resources>
    <name>ТипИнформированияПолучателейЗаказов</name>
    <type>
      <types>EnumRef.ТипыИнформированияПолучателейЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>МетодикаТарификацииЗаборов</name>
    <type>
      <types>EnumRef.МетодыТарификацииЗаборов</types>
    </type>
  </resources>
  <resources>
    <name>СистемаРаспознаванияАдресовПриРучнойПривязке</name>
    <type>
      <types>EnumRef.СистемыРаспознаванияАдресов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>МодельТерминалаAssist</name>
    <type>
      <types>CatalogRef.МоделиОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ОбъединениеФункционалаЛогистаИКассира</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаОтменаПолучателем</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>НеПечататьБланкиЗаказовПоЗаказамДоставки</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПечатьБланковЗаказовКоличествоПозицийВЗаказе</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаКонтрагентовДляЗагрузкиИзБП</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/НастройкиУчетаОбщие/Forms/ФормаНастройки/Module.bsl
&НаКлиенте
Процедура УстановитьНастройку(Команда)
	ЗаписатьНастйроки();
КонецПроцедуры

Процедура ЗаписатьНастйроки()
	НовЗап = РегистрыСведений.НастройкиУчетаОбщие.СоздатьМенеджерЗаписи();
	НовЗап.Период = ТекущаяДата();
	НовЗап.ПовышающийКоэффициентТарификацииКилометража = ПовышающийКоэффициентТарификацииКилометража;
	НовЗап.СистемаРаспознаванияАдресов = СистемаРаспознаванияАдресов;
	НовЗап.ТипИнформированияПолучателейЗаказов = ТипИнформированияПолучателейЗаказов;
	НовЗап.МетодикаТарификацииЗаборов = МетодикаТарификацииЗаборов;
	//+Степанов Задача № 3503 на форму добавлен реквизит СистемаРаспознаванияАдресовПриРучнойПривязке
	НовЗап.СистемаРаспознаванияАдресовПриРучнойПривязке = СистемаРаспознаванияАдресовПриРучнойПривязке;
	НовЗап.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе = ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе;
	НовЗап.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе = ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе;
	
	НовЗап.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой = ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой;
	НовЗап.МодельТерминалаAssist = МодельТерминалаAssist;
	НовЗап.ОбъединениеФункционалаЛогистаИКассира = ОбъединениеФункционалаЛогистаИКассира;
	
	НовЗап.НеПечататьБланкиЗаказовПоЗаказамДоставки = НеПечататьБланкиЗаказовПоЗаказамДоставки;
	НовЗап.ПечатьБланковЗаказовКоличествоПозицийВЗаказе = ПечатьБланковЗаказовКоличествоПозицийВЗаказе;
	НовЗап.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки = ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки;
	
	НовЗап.ПричинаОтказаПереносаОтменаПолучателем = ПричинаОтказаПереносаОтменаПолучателем;
	НовЗап.ГруппаКонтрагентовДляЗагрузкиИзБП = ГруппаКонтрагентовДляЗагрузкиИзБП;
	
	НовЗап.Записать(Истина);	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//+Степанов Задача № 3503 на форму добавлен реквизит СистемаРаспознаванияАдресовПриРучнойПривязке
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НастройкиУчетаОбщиеСрезПоследних.ПовышающийКоэффициентТарификацииКилометража КАК ПовышающийКоэффициентТарификацииКилометража,
	               |	НастройкиУчетаОбщиеСрезПоследних.СистемаРаспознаванияАдресов КАК СистемаРаспознаванияАдресов,
	               |	НастройкиУчетаОбщиеСрезПоследних.ТипИнформированияПолучателейЗаказов КАК ТипИнформированияПолучателейЗаказов,
	               |	НастройкиУчетаОбщиеСрезПоследних.МетодикаТарификацииЗаборов КАК МетодикаТарификацииЗаборов,
	               |	НастройкиУчетаОбщиеСрезПоследних.СистемаРаспознаванияАдресовПриРучнойПривязке КАК СистемаРаспознаванияАдресовПриРучнойПривязке,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе КАК ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе КАК ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой КАК ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаОтменаПолучателем КАК ПричинаОтказаПереносаОтменаПолучателем,
	               |	НастройкиУчетаОбщиеСрезПоследних.ОбъединениеФункционалаЛогистаИКассира КАК ОбъединениеФункционалаЛогистаИКассира,
	               |	НастройкиУчетаОбщиеСрезПоследних.МодельТерминалаAssist КАК МодельТерминалаAssist,
	               |	НастройкиУчетаОбщиеСрезПоследних.НеПечататьБланкиЗаказовПоЗаказамДоставки КАК НеПечататьБланкиЗаказовПоЗаказамДоставки,
	               |	НастройкиУчетаОбщиеСрезПоследних.ПечатьБланковЗаказовКоличествоПозицийВЗаказе КАК ПечатьБланковЗаказовКоличествоПозицийВЗаказе,
				   |	НастройкиУчетаОбщиеСрезПоследних.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки КАК ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки,
				   |	НастройкиУчетаОбщиеСрезПоследних.ГруппаКонтрагентовДляЗагрузкиИзБП КАК ГруппаКонтрагентовДляЗагрузкиИзБП
	               |ИЗ
	               |	РегистрСведений.НастройкиУчетаОбщие.СрезПоследних КАК НастройкиУчетаОбщиеСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПовышающийКоэффициентТарификацииКилометража  = Выборка.ПовышающийКоэффициентТарификацииКилометража;
		СистемаРаспознаванияАдресов = Выборка.СистемаРаспознаванияАдресов;
		ТипИнформированияПолучателейЗаказов = Выборка.ТипИнформированияПолучателейЗаказов;
		МетодикаТарификацииЗаборов = Выборка.МетодикаТарификацииЗаборов;
		СистемаРаспознаванияАдресовПриРучнойПривязке = Выборка.СистемаРаспознаванияАдресовПриРучнойПривязке;
		ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе = Выборка.ПричинаОтказаПереносаПриОтменеЗаказаПартнеромВРейсе;
		ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе = Выборка.ПричинаОтказаПереносаПриСменеДатыДоставкиЗаказаПартнеромВРейсе;
		ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой = Выборка.ПричинаОтказаПереносаПриВыполненииЗаказаСРанееПеренесеннойДатой;
		ОбъединениеФункционалаЛогистаИКассира = Выборка.ОбъединениеФункционалаЛогистаИКассира;  
		ПричинаОтказаПереносаОтменаПолучателем = Выборка.ПричинаОтказаПереносаОтменаПолучателем;
		НеПечататьБланкиЗаказовПоЗаказамДоставки = Выборка.НеПечататьБланкиЗаказовПоЗаказамДоставки;
		ПечатьБланковЗаказовКоличествоПозицийВЗаказе = Выборка.ПечатьБланковЗаказовКоличествоПозицийВЗаказе;
		ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки = Выборка.ПричинаОтказаПереносаПриПереносеДатыДоставкиЗаказаПриЗагрузкеЗаказаИзАдминки;
		МодельТерминалаAssist = Выборка.МодельТерминалаAssist;
		ГруппаКонтрагентовДляЗагрузкиИзБП = Выборка.ГруппаКонтрагентовДляЗагрузкиИзБП;
	КонецЦикла;	
КонецПроцедуры
